app/views/person/_person_row.html.erb

<td data-column="location">
  <%= title_case(person.locations&.pluck(:name).join(", ")) %>
---
SELECT "locations"."name" FROM "locations" WHERE "locations"."person_id" = ?  [["person_id", 2]]

<td data-column="affilations">
  <%= person.affilations&.pluck(:name).join(", ") %>
---
SELECT "affilations"."name" FROM "affilations" WHERE "affilations"."person_id" = ?  [["person_id", 1]]