app/controllers/person_controller.rb

  def import_csv
    if !params["person"] || !params.require(:person).permit(:file)
      flash[:alert] = 'Please upload a valid CSV file.'
    else
      permit_params = params.require(:person).permit(:file)
      file = permit_params[:file]
      if (file.present? && File.extname(file.original_filename) == ".csv")
          people_attrbutes = []
            begin
              ActiveRecord::Base.transaction do
                CSV.foreach(file.path, headers: true, encoding: 'iso-8859-1:utf-8') do |row|
                  first_name, last_name = get_first_last_name(row['Name'])
                  location = row['Location']
                  affiliation = row['Affiliations']
                  locations = insert_locations(location)
                  affiliations = insert_affilations(affiliation)
                  if affiliations.length == 0
                    next
                  end
                  person_attrbutes = {
                    first_name: first_name,
                    last_name: last_name,
                    species: row['Species'],
                    gender: row['Gender'],
                    weapon: row['Weapon'],
                    vehicle: row['Vehicle'],
                    locations: locations,
                    affilations: affiliations
                  }
                  people_attrbutes << person_attrbutes
---
INSERT INTO "people" ("first_name", "species", "gender", "weapon", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "yoda"], ["species", "Unknown"], ["gender", "Male"], ["weapon", "Lightsaber"], ["created_at", "2023-07-23 02:44:12.608564"], ["updated_at", "2023-07-23 02:44:12.608564"]]